In [1]:
import pandas as pd

import pymysql
pymysql.install_as_MySQLdb()

import MySQLdb
# pip install mysqlclient

db = MySQLdb.connect(
    "db.fastcamp.us",  # DATABASE_HOST
    "root",  # DATABASE_USERNAME
    "dkstncks",  # DATABASE_PASSWORD
    "world",  # DATABASE_NAME
    charset='utf8',
)

SQL_QUERY = """
    SELECT *
    FROM Country
    ;
"""

country_df = pd.read_sql(SQL_QUERY, db)

In [2]:
# 텍스트 마이닝 ( 특정 테스트가 포함되어 있는 row를 가져오는 방법 )

In [3]:
# GovernmentForm에 Republic이라는 텍스트가 포함된 열

In [4]:
df = pd.read_sql("SELECT * FROM Country;", db)

In [5]:
df[df["GovernmentForm"].str.contains("Republic")].head()

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL
8,ARG,Argentina,South America,South America,2780400.0,1816.0,37032000,75.1,340238.0,323310.0,Argentina,Federal Republic,Fernando de la Rúa,69.0,AR
9,ARM,Armenia,Asia,Middle East,29800.0,1991.0,3520000,66.4,1813.0,1627.0,Hajastan,Republic,Robert Kotšarjan,126.0,AM
15,AUT,Austria,Europe,Western Europe,83859.0,1918.0,8091800,77.7,211860.0,206025.0,Österreich,Federal Republic,Thomas Klestil,1523.0,AT

In [6]:
df[df["GovernmentForm"].str.endswith("Republic")].head()

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL
8,ARG,Argentina,South America,South America,2780400.0,1816.0,37032000,75.1,340238.0,323310.0,Argentina,Federal Republic,Fernando de la Rúa,69.0,AR
9,ARM,Armenia,Asia,Middle East,29800.0,1991.0,3520000,66.4,1813.0,1627.0,Hajastan,Republic,Robert Kotšarjan,126.0,AM
15,AUT,Austria,Europe,Western Europe,83859.0,1918.0,8091800,77.7,211860.0,206025.0,Österreich,Federal Republic,Thomas Klestil,1523.0,AT

In [8]:
df[df["GovernmentForm"].str.startswith("Republic")].head()

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,José Eduardo dos Santos,56.0,AO
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,Shqipëria,Republic,Rexhep Mejdani,34.0,AL
9,ARM,Armenia,Asia,Middle East,29800.0,1991.0,3520000,66.4,1813.0,1627.0,Hajastan,Republic,Robert Kotšarjan,126.0,AM
17,BDI,Burundi,Africa,Eastern Africa,27834.0,1962.0,6695000,46.2,903.0,982.0,Burundi/Uburundi,Republic,Pierre Buyoya,552.0,BI
19,BEN,Benin,Africa,Western Africa,112622.0,1960.0,6097000,50.2,2357.0,2141.0,Bénin,Republic,Mathieu Kérékou,187.0,BJ

In [13]:
# SQL 이용

SQL_QUERY = """
    SELECT Name, GovernmentForm
    FROM Country
    WHERE
        GovernmentForm LIKE "%Republic%"
    ;
"""

pd.read_sql(SQL_QUERY, db).head()

        Name    GovernmentForm
0     Angola          Republic
1    Albania          Republic
2  Argentina  Federal Republic
3    Armenia          Republic
4    Austria  Federal Republic

In [14]:
db = MySQLdb.connect(
    "db.fastcamp.us",  # DATABASE_HOST
    "root",  # DATABASE_USERNAME
    "dkstncks",  # DATABASE_PASSWORD
    "sakila",  # DATABASE_NAME
    charset='utf8',
)

In [16]:
customer_df = pd.read_sql("SELECT * FROM customer;", db)
address_df = pd.read_sql("SELECT * FROM address;", db)

In [17]:
customer_df.columns

Index(['customer_id', 'store_id', 'first_name', 'last_name', 'email',
       'address_id', 'active', 'create_date', 'last_update'],
      dtype='object')

In [18]:
address_df.columns

Index(['address_id', 'address', 'address2', 'district', 'city_id',
       'postal_code', 'phone', 'last_update'],
      dtype='object')

In [22]:
customer_df.merge(address_df, on="address_id")[["first_name","last_name","address"]].head()

  first_name last_name            address
0       MARY     SMITH     1913 Hanoi Way
1   PATRICIA   JOHNSON   1121 Loja Avenue
2      LINDA  WILLIAMS  692 Joliet Street
3    BARBARA     JONES   1566 Inegl Manor
4  ELIZABETH     BROWN    53 Idfu Parkway

In [24]:
# SQL (1)
SQL_QUERY = """
    SELECT *
    FROM customer, address
    ;
"""

pd.read_sql(SQL_QUERY, db).head()

# customer => 599개
# address => 603개

# 데이터 테이블을 합친 다음에( 모든 row에 대한 곱) where 조건문을 통해 데이터 추출

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update,address_id,address,address2,district,city_id,postal_code,phone,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20,1,47 MySakila Drive,None,Alberta,300,,,2014-09-25 22:30:27
1,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20,2,28 MySQL Boulevard,None,QLD,576,,,2014-09-25 22:30:09
2,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20,3,23 Workhaven Lane,None,Alberta,300,,14033335568,2014-09-25 22:30:27
3,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20,4,1411 Lillydale Drive,None,QLD,576,,6172235589,2014-09-25 22:30:09
4,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,2014-09-25 22:31:53

In [25]:
# SQL(2)

SQL_QUERY = """
    SELECT customer.first_name, customer.last_name, address.address
    FROM customer
    JOIN address ON customer.address_id = address.address_id
    ;
"""

pd.read_sql(SQL_QUERY, db).head()

  first_name last_name            address
0       MARY     SMITH     1913 Hanoi Way
1   PATRICIA   JOHNSON   1121 Loja Avenue
2      LINDA  WILLIAMS  692 Joliet Street
3    BARBARA     JONES   1566 Inegl Manor
4  ELIZABETH     BROWN    53 Idfu Parkway

In [26]:
# join이 보기엔 어려움. 그러나 속도는 더 빠름..!

In [27]:
db = MySQLdb.connect(
    "db.fastcamp.us",  # DATABASE_HOST
    "root",  # DATABASE_USERNAME
    "dkstncks",  # DATABASE_PASSWORD
    "world",  # DATABASE_NAME
    charset='utf8',
)

In [28]:
country_df = pd.read_sql("SELECT * FROM Country;", db)
city_df = pd.read_sql("SELECT * FROM City;", db)

In [30]:
country_df.columns

Index(['Code', 'Name', 'Continent', 'Region', 'SurfaceArea', 'IndepYear',
       'Population', 'LifeExpectancy', 'GNP', 'GNPOld', 'LocalName',
       'GovernmentForm', 'HeadOfState', 'Capital', 'Code2'],
      dtype='object')

In [31]:
city_df.columns

Index(['ID', 'Name', 'CountryCode', 'District', 'Population'], dtype='object')

In [33]:
city_df.merge(country_df, left_on="CountryCode", right_on="Code")[["Name_x","Name_y"]].head()

           Name_x       Name_y
0           Kabul  Afghanistan
1        Qandahar  Afghanistan
2           Herat  Afghanistan
3  Mazar-e-Sharif  Afghanistan
4       Amsterdam  Netherlands

In [38]:
# SQL (1)
SQL_QUERY = """
    SELECT co.Name "Country Name", ci.Name "City Name"
    FROM Country co, City ci
    WHERE co.Code = ci.CountryCode
    ;

"""

pd.read_sql(SQL_QUERY, db).head()

  Country Name       City Name
0        Aruba      Oranjestad
1  Afghanistan           Kabul
2  Afghanistan        Qandahar
3  Afghanistan           Herat
4  Afghanistan  Mazar-e-Sharif

In [39]:
# SQL (2)
SQL_QUERY = """
    SELECT co.Name "Country Name", ci.Name "City Name"
    FROM Country co
        JOIN City ci
        ON co.Code = ci.CountryCode
    ;
"""

pd.read_sql(SQL_QUERY, db).head()

  Country Name       City Name
0        Aruba      Oranjestad
1  Afghanistan           Kabul
2  Afghanistan        Qandahar
3  Afghanistan           Herat
4  Afghanistan  Mazar-e-Sharif

In [40]:
db = MySQLdb.connect(
    "db.fastcamp.us",  # DATABASE_HOST
    "root",  # DATABASE_USERNAME
    "dkstncks",  # DATABASE_PASSWORD
    "sakila",  # DATABASE_NAME
    charset='utf8',
)

In [42]:
SQL_QUERY = """
    SELECT *
    FROM rental
    ;
"""

rental_df = pd.read_sql(SQL_QUERY, db)

In [44]:
rental_df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [45]:
rental_df = rental_df[["rental_id", "rental_date"]]
rental_df.head()

   rental_id         rental_date
0          1 2005-05-24 22:53:30
1          2 2005-05-24 22:54:33
2          3 2005-05-24 23:03:39
3          4 2005-05-24 23:04:41
4          5 2005-05-24 23:05:21

In [46]:
rental_df["month"] = rental_df["rental_date"].apply(lambda x: str(x)[:7])

C:\Users\Bsy\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [47]:
rental_df.head()

   rental_id         rental_date    month
0          1 2005-05-24 22:53:30  2005-05
1          2 2005-05-24 22:54:33  2005-05
2          3 2005-05-24 23:03:39  2005-05
3          4 2005-05-24 23:04:41  2005-05
4          5 2005-05-24 23:05:21  2005-05

In [48]:
month_groups = rental_df.groupby("month")

In [50]:
month_groups.get_group("2005-05").head()

   rental_id         rental_date    month
0          1 2005-05-24 22:53:30  2005-05
1          2 2005-05-24 22:54:33  2005-05
2          3 2005-05-24 23:03:39  2005-05
3          4 2005-05-24 23:04:41  2005-05
4          5 2005-05-24 23:05:21  2005-05

In [51]:
rental_df["month"].unique()

array(['2005-05', '2005-06', '2005-07', '2005-08', '2006-02'], dtype=object)

In [56]:
pd.DataFrame([
        {
            "month": month,
            "rental count" : len(month_groups.get_group(month)),
        }
        for month
        in rental_df["month"].unique()
        
    ])

     month  rental count
0  2005-05          1156
1  2005-06          2311
2  2005-07          6709
3  2005-08          5686
4  2006-02           182

In [57]:
rental_df.groupby("month").size()

month
2005-05    1156
2005-06    2311
2005-07    6709
2005-08    5686
2006-02     182
dtype: int64

In [59]:
import numpy as np

In [60]:
rental_df.groupby("month").agg({"rental_id": np.size})

         rental_id
month
2005-05       1156
2005-06       2311
2005-07       6709
2005-08       5686
2006-02        182

In [61]:
SQL_QUERY = """
    SELECT LEFT(rental_date, 7) "Month", COUNT(*) "Total Rental"
    FROM rental
    GROUP BY Month
    ;
"""

pd.read_sql(SQL_QUERY, db)

     Month  Total Rental
0  2005-05          1156
1  2005-06          2311
2  2005-07          6709
3  2005-08          5686
4  2006-02           182

In [62]:
payment_df = pd.read_sql("SELECT * FROM payment;", db)

In [64]:
payment = payment_df[["payment_id", "amount", "payment_date"]]

In [66]:
payment_df["month"] = payment_df["payment_date"].apply(lambda x: str(x)[:7])

In [67]:
# 합치거나 평균을 내거나

In [70]:
payment_df.groupby("month").agg({"payment_id":np.size, "amount": {np.sum, np.mean}})

           amount           payment_id
              sum      mean payment_id
month
2005-05   4824.43  4.169775       1157
2005-06   9631.88  4.166038       2312
2005-07  28373.89  4.227968       6711
2005-08  24072.13  4.232835       5687
2006-02    514.18  2.825165        182

In [71]:
SQL_QUERY = """
    SELECT
        LEFT(payment_date, 7) Month,
        COUNT(*) "Total Payment",
        SUM(amount) "Total Revenue",
        AVG(amount) "Average Payment"
    FROM payment
    GROUP BY Month
    ;
"""

pd.read_sql(SQL_QUERY, db)

     Month  Total Payment  Total Revenue  Average Payment
0  2005-05           1157        4824.43         4.169775
1  2005-06           2312        9631.88         4.166038
2  2005-07           6711       28373.89         4.227968
3  2005-08           5687       24072.13         4.232835
4  2006-02            182         514.18         2.825165